// _________________________________________________
// - Cтворити масив та вивести його в консоль:
//   з 5 числових значень
// - з 5 стічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// let numbersPlayer = [10, 7, 11, 99, 1];
// let footballPlayer = ['Messi','Ronaldo','NeymarJr','Bukin','Krivonozhko'];
// let zzz = ['green', 'yellow', 'gold', 'white', 'blue', [1, 2.5, -4, 123.456, 777], true, true, false, true, false];

// _________________________________________________
// - Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
// let cloud = [];
// cloud[0] = 0;
// cloud[1] = 1;
// cloud[2] = 2;
// cloud[3] = 3;
//
// console.log(cloud);

// _________________________________________________
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
// - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
// for (let i=0; i<10; i++){
//     document.write('div_');
// }

// for (let i=0; i<10; i++){
//     document.write('div_'+i);
// }

// _________________________________________________
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
// - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
// let i=0;
// while (i<20){
//     document.write('<h1>div_</h1>');
//     i++
// }

// let i=0;
// while (i<20){
//     document.write('<h1>div_'+i+'</h1>');
//     i++
// }

// _________________________________________________
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// let numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
// for (let i=0; i<numbers.length;i++){
//     console.log(numbers[i])
// }

// let words = ['black','white','yellow','green','red','blue','pink','brown','grey','orange'];
// for (let i=0; i<words.length;i++){
//     console.log(words[i])
// }

// let other = [1, 2, 3, 4, 5, true, false,'ok','web','okten'];
// for (let i=0; i<other.length;i++){
//     console.log(other[i])
// }

// _________________________________________________
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// let okten =[10,9,8,7,6,5,4,3,2,1,'okten1','okten2','okten3','okten4','okten5','okten6','okten7',
//     'okten8','okten9','okten10',true,false,true,false,true,false,true,false,true,false,];
//
// for (let i=0;i<okten.length;i++){
//     if (typeof okten[i]==='boolean') {
//         console.log(okten[i])
//     }else{
//
//     }
// }

// _________________________________________________
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// let okten =[10,9,8,7,6,5,4,3,2,1,'okten1','okten2','okten3','okten4','okten5','okten6','okten7',
//     'okten8','okten9','okten10',true,false,true,false,true,false,true,false,true,false,];

// for (let i=0;i<okten.length;i++){
//     if (typeof okten[i]==='number') {
//         console.log(okten[i])
//     }else{
//
//     }
// }
// _________________________________________________
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
// let okten =[10,9,8,7,6,5,4,3,2,1,'okten1','okten2','okten3','okten4','okten5','okten6','okten7',
//     'okten8','okten9','okten10',true,false,true,false,true,false,true,false,true,false,];
//
// for (let i=0;i<okten.length;i++){
//     if (typeof okten[i]==='string') {
//         console.log(okten[i])
//     }else{
//
//     }
// }
// _________________________________________________
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// let cloud = [];
// cloud[0] = 0;
// cloud[1] = 1;
// cloud[2] = 2;
// cloud[3] = 3;
// cloud[4] = 'string1';
// cloud[5] = 'string2';
// cloud[6] = 'string3';
// cloud[7] = 'string4';
// cloud[8] = true;
// cloud[9] = NaN;
//
// for (let i = 0; i < cloud.length; i++) {
//     console.log(cloud[i]);
//
// }

// _________________________________________________
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// for (let i=0; i<10;i++){
//     console.log('step = ', i)
//     document.write(`step : ${i}<br>`)
// }

// for (let i=0; i<100;i++){
//     console.log('step = ', i)
//     document.write(`step : ${i}<br>`)
// }

// for (let i=0; i<200;i=i+2){
//     console.log('step = ', i)
//     document.write(`step : ${i}<br>`)
// }

// _________________________________________________
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

// for (let i=0;i<100;i++) {
//     if (i%2===0){
//     console.log('step = ', i);
//     document.write(`step : ${i}<br>`)
//     }
//
// }

// for (let i=0;i<100;i++) {
//     if (i%2===1){
//         console.log('step = ', i);
//         document.write(`step : ${i}<br>`)
//     }
//
// }


// _________________________________________________
// Додатково
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let abc = '';
//
// for (let i=0; i<arr.length; i++) {
//     abc = abc+ arr[i]
// }
// console.log(abc);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let abc = '';
// let i=0;
//
// while (i<arr.length){
//     abc= abc+ arr[i]
//     i++;
// }
//
// console.log(abc);
//
// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
// let arr = [ 'a', 'b', 'c'];
// let abc = '';
// for (let string of arr) {
//     abc = abc+ string;
// }
// console.log(abc);

// - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for in зібрати всі букви в слово.

// let arr = [ 'a', 'b', 'c'];
// let abc = '';
// for (let string in arr) {
//     abc = abc+ arr[string];
// }
// console.log(abc);

// _________________________________________________
// _________________________________________________
// _________________________________________________
// _________________________________________________

// - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
// let arr = [ 'a', 'b', 'c'];
// for (let i=1; i<=3; i++) {
//     arr.push(i);
// }
// console.log([arr]);

// - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
// let arr=[1,2,3]
// let newArr = arr.reverse();
// console.log(newArr);

// - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
// let arr= [1,2,3];
// for (let i=4; i<=6; i++) {
//     arr.push(i);
// }
// console.log([arr]);

// - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
// let arr= [1,2,3];
// for (let i=6; i>=4; i--) {
//     arr.unshift(i);
// }
// console.log([arr]);

// Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// const arr = ['js', 'css', 'jq'];
// console.log(arr);
// const first= arr.shift();
// console.log('first',first);
// console.log('arr',arr);

// - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// const arr = ['js', 'css', 'jq'];
// console.log(arr);
// const first= arr.pop();
// console.log('first',first);
// console.log('arr',arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
// let numbers = [1,2,3,4,5]
// console.log(numbers.slice(3));

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
// let numbers = [1,2,3,4,5]
// console.log(numbers.slice(0,2));

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
// let arr =[1,2,3,4,5];
// arr.splice(1,2);
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let arr =[1,2,3,4,5];
// arr.splice(3,0,'a','b','c');
// console.log(arr);

// - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let arr =[1,2,3,4,5];
// arr.splice(1,0,'a','b');
// arr.splice(6,0,'c');
// arr.splice(8,0,'e');
// console.log(arr);

// - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// let arr = [2,20,7,3,6,8,77,55,33,66];
// for (let i=0;i<arr.length;i++) {
//     if(arr[i]%2===0){
//         console.log(arr[i])
//     }
// }

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// let arr = [2,20,7,3,6,8,77,55,33,66];
// let newArr =[];
//
// for (let i=0;i<arr.length;i++){
//     newArr.push(arr[i])
// }
// console.log(newArr);

// - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// let arr = [2,20,7,3,6,8,77,55,33,66];
// let newArr =[];
//
// for (let i=0;i<arr.length;i++){
//     newArr[i]=(arr[i])
// }
// console.log(newArr);

// _________________________________________________
// _________________________________________________
// _________________________________________________
// _________________________________________________


// Зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
//     1. перебрати його циклом while
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i=0;
// while (i<arr.length){
//     console.log(arr[i]);
//     i++
// }

// 2. перебрати його циклом for
//     let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++) {
//     console.log(arr[i])
// }

// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 1;
// while (i < arr.length){
//     console.log(arr[i]);
//     i = i + 2;
// }





// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++) {
//     if([i]%2===1){
//         console.log(arr[i])
//     }
// }

// 5. перебрати циклом while та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// let i = 0;
// while (i < arr.length){
//     console.log(arr[i]);
//     i = i + 2;
// }

// 6. перебрати циклом for та вивести  числа тільки парні  значення
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i=0;i<arr.length;i++) {
//     if([i]%2===0){
//         console.log(arr[i])
//     }
// }

// 7. замінити кожне число кратне 3 на слово "okten"
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// for (let i = 0; i<arr.length; i++) {
//     if(arr[i]%3===0){
//         arr[i]='okten';
//     }
// }
// console.log(arr);

// 8. вивести масив в зворотньому порядку.
// let arr = [2,17,13,6,22,31,45,66,100,-18];
// console.log(arr.reverse());

// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед) ****************


// створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr1 = [];
// let arr2 =[]
// for (i=0; i<50; i++){
//     i%2===0 ? arr1[i]=i : arr2[i]=i
// }
// console.log(arr1)
// console.log(arr2);

// _________________________________________________
// _________________________________________________
// _________________________________________________
// _________________________________________________
// 1. заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
// let arr1 = [];
// let arr2 =[]
// for (i=0; i<50; i++){
//     i%2===0 ? arr1[i]=i : arr2[i]=i
// }
// console.log(arr1)
// console.log(arr2);

// 3. 1 используя Math.random заполнить массив из ???(сколько хотите) элементов.
//     диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)
//            2. вывести на консоль  каждый третий елемент
//            3. вывести на консоль  каждый третий елемент, но при условии что его значение является парным.
//            4. вывести на консоль  каждый третий елемент, но при условии что он имеет парное значение и записать их в другой массив.
//            5. Вывести каждый елемент массива у которого соседний с права элемент - парный

// (1)
// let arr= [];
// for (i=0; i<99; i++){
//     arr[i]=Math.floor((Math.random()*732-8)+8)
// }
// console.log(arr);

// (2)
// for (let i=2; i<arr.length; i+=3){
//     console.log(arr[i])
// }

// (3)
// for (let i=2; i<arr.length; i+=3){
//     if (arr[i]%2===0){
//         console.log(arr[i])
//     }
// }

// (4)
// let newArr = [];
// for (let i=2; i<arr.length; i+=3){
//     if (arr[i]%2===0){
//         newArr.push(arr[i]);
//     }
// }

// (5)
// for (let i=0; i<arr.length; i++){
//     if (arr[i+1]%2 === 0){
//         console.log(arr[i])
//     }
// }

// 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// let arr = [100,250,50,168,120,345,188];
// let sum = 0;
// let mid = 0;
// for (i=0; i<arr.length; i++){
//     sum+= arr[i];
//     mid = sum/arr.length;
// }
// console.log(mid);

// 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// let arr =[];
// for (let i=0; i<10; i++){
//     arr[i]=Math.floor((Math.random()*1000-1)+1)
// }
// console.log(arr);
// let newArr =[];
// for (i=0; i<arr.length; i++){
//     newArr[i] =arr[i]*5;
// }
// console.log(newArr);

// 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// додати його в інший масив.*?*?*?*?*?*?*?

// let arr = [1,2,3,'string1', 'string2',false,true,NaN, 4, 5];
// let newArr = []
// for (let i=0; i<10; i++){
//__________typeof_________????
// }

